Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
flow[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:fe4c523a9cc765678fa9f4bd28f479d47a301197ebb6a51700787dab09f1c1e5" -> (known after apply)
        name                 = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:fe4c523a9cc765678fa9f4bd28f479d47a301197ebb6a51700787dab09f1c1e5" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "933e6bff63595a34e847e683409368fce0482300" -> "1456cd8bf2eab1adf33735d01240b2b97ddda8ec"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-batchStarter"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:54",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6597875147142223761" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708056901074000" -> "1758793430167432000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-batchSubmit"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:54",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6233318879530309562" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708057230051000" -> "1758793429672491000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:54",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7618658613125447627" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708056957276200" -> "1758793429468580000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-initFlow"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:54",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_binaries_layer:20",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4158264041836677433" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708057230393800" -> "1758793429787642000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcFigures"
      ~ image_uri                      = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers@sha256:fe4c523a9cc765678fa9f4bd28f479d47a301197ebb6a51700787dab09f1c1e5" -> (known after apply)
      ~ last_modified                  = "2025-09-24T10:05:46.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcNotes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:54",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "727595448951836367" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708056990315000" -> "1758793429924606000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:54",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9064024658251239952" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708057066030000" -> "1758793429701162000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_libraries_layer:21" -> (known after apply)
      ~ code_sha256                 = "9o7wcEyBLOc4UnsOslm3NEUyPliCtwBVfWSJSMEcbOE=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-24T10:04:07.948+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_libraries_layer:21" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/09988ea9fbb7539aace61f7b2e4deeb22dff16eab99b6ee6fa5a96d13d5d9738.zip" -> "builds/cfa8abc9f08e94c69d1ac8f55f6ca372bd87bee5a7c8b57a240d3401d03d5b31.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 172649 -> (known after apply)
      ~ version                     = "21" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250730052938336300000001/builds/09988ea9fbb7539aace61f7b2e4deeb22dff16eab99b6ee6fa5a96d13d5d9738.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "2be48a11039ab158e284fa23b6d59306" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20250730052938336300000001/builds/09988ea9fbb7539aace61f7b2e4deeb22dff16eab99b6ee6fa5a96d13d5d9738.zip" -> (known after apply)
      ~ key                           = "builds/09988ea9fbb7539aace61f7b2e4deeb22dff16eab99b6ee6fa5a96d13d5d9738.zip" -> "builds/cfa8abc9f08e94c69d1ac8f55f6ca372bd87bee5a7c8b57a240d3401d03d5b31.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/09988ea9fbb7539aace61f7b2e4deeb22dff16eab99b6ee6fa5a96d13d5d9738.zip" -> "builds/cfa8abc9f08e94c69d1ac8f55f6ca372bd87bee5a7c8b57a240d3401d03d5b31.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/cfa8abc9f08e94c69d1ac8f55f6ca372bd87bee5a7c8b57a240d3401d03d5b31.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/cfa8abc9f08e94c69d1ac8f55f6ca372bd87bee5a7c8b57a240d3401d03d5b31.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5136739608324657221" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/09988ea9fbb7539aace61f7b2e4deeb22dff16eab99b6ee6fa5a96d13d5d9738.zip" -> "builds/cfa8abc9f08e94c69d1ac8f55f6ca372bd87bee5a7c8b57a240d3401d03d5b31.zip"
          ~ "timestamp" = "1758708061228585000" -> "1758793433720552000"
        }
    }

  # module.pgxflow[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:54" -> (known after apply)
      ~ code_sha256                 = "RQnIGwA43312MF82FkEQ06IiRT2XhML91hY1qOkde6U=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-24T10:04:03.483+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:54" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/2b037e99edef3503f7dd4cd5f2c846681f8883a34f06607030d6226a5baa6d66.zip" -> "builds/f8c13438ec8c15fd501f14a8f4eb1150a504ab87a711e534ab380490e8ce61ae.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 22795 -> (known after apply)
      ~ version                     = "54" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250730052938336300000001/builds/2b037e99edef3503f7dd4cd5f2c846681f8883a34f06607030d6226a5baa6d66.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "539b8939359d5733bc518d42f570557d" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20250730052938336300000001/builds/2b037e99edef3503f7dd4cd5f2c846681f8883a34f06607030d6226a5baa6d66.zip" -> (known after apply)
      ~ key                           = "builds/2b037e99edef3503f7dd4cd5f2c846681f8883a34f06607030d6226a5baa6d66.zip" -> "builds/f8c13438ec8c15fd501f14a8f4eb1150a504ab87a711e534ab380490e8ce61ae.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/2b037e99edef3503f7dd4cd5f2c846681f8883a34f06607030d6226a5baa6d66.zip" -> "builds/f8c13438ec8c15fd501f14a8f4eb1150a504ab87a711e534ab380490e8ce61ae.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f8c13438ec8c15fd501f14a8f4eb1150a504ab87a711e534ab380490e8ce61ae.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f8c13438ec8c15fd501f14a8f4eb1150a504ab87a711e534ab380490e8ce61ae.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5756416318372937894" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2b037e99edef3503f7dd4cd5f2c846681f8883a34f06607030d6226a5baa6d66.zip" -> "builds/f8c13438ec8c15fd501f14a8f4eb1150a504ab87a711e534ab380490e8ce61ae.zip"
          ~ "timestamp" = "1758708057319360000" -> "1758793429767095000"
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:2477abc459c3efaf68261f5f27579d629af9adb24afdd0e33750f60cdd907648557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:2477abc459c3efaf68261f5f27579d629af9adb24afdd0e33750f60cdd907648" -> (known after apply)
        name         = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ repo_digest  = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:03522a06568d28f95a017f8df5c500edbd73091cc10dcfb549bd3e49453d94e4" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "331262214c5eae6aaf8e89cce40c6e3d4aab635f" -> "1e224218ce73f11d058c9478bfd3a5de789768c7"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:03522a06568d28f95a017f8df5c500edbd73091cc10dcfb549bd3e49453d94e4" -> (known after apply)
        name                 = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:03522a06568d28f95a017f8df5c500edbd73091cc10dcfb549bd3e49453d94e4" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "331262214c5eae6aaf8e89cce40c6e3d4aab635f" -> "1e224218ce73f11d058c9478bfd3a5de789768c7"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/0f4cb7de207eb5b7090dc068a007c631fb43de87fc2d93b36c607c54991a9a2b.zip" -> "builds/b70ae018667a505093c1053b98723fc9ae804666051b9716db887f7fe4fc1b49.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-09-24T10:04:31.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/b70ae018667a505093c1053b98723fc9ae804666051b9716db887f7fe4fc1b49.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/b70ae018667a505093c1053b98723fc9ae804666051b9716db887f7fe4fc1b49.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3143973742629160039" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/0f4cb7de207eb5b7090dc068a007c631fb43de87fc2d93b36c607c54991a9a2b.zip" -> "builds/b70ae018667a505093c1053b98723fc9ae804666051b9716db887f7fe4fc1b49.zip"
          ~ "timestamp" = "1758708047450582000" -> "1758793420227036000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/2868e687f339ac9b843d22a32afac9c2e4f82f587de99f23d14cd03a64b46432.zip" -> "builds/5453ffe40ba218732823dd17b648b15e50d9fdc4bfa7f6218af67cd73360c4cc.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-09-24T10:06:31.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/5453ffe40ba218732823dd17b648b15e50d9fdc4bfa7f6218af67cd73360c4cc.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/5453ffe40ba218732823dd17b648b15e50d9fdc4bfa7f6218af67cd73360c4cc.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5758334422845071889" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2868e687f339ac9b843d22a32afac9c2e4f82f587de99f23d14cd03a64b46432.zip" -> "builds/5453ffe40ba218732823dd17b648b15e50d9fdc4bfa7f6218af67cd73360c4cc.zip"
          ~ "timestamp" = "1758708046823273000" -> "1758793419116820000"
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6375368739420256071" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708047350535000" -> "1758793419641597000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:14",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4939090825241727886" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708047015963000" -> "1758793419130423000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/52e411fd7f12ac5bd584f8e5ea491f5cf1fe84c292c993393ab51989d07a9f8a.zip" -> "builds/a2410dd2098bfb29e6c3cc6ac0e7666e01b73952d667fcb371bb63066e79bc3e.zip"
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-09-25T04:53:56.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a2410dd2098bfb29e6c3cc6ac0e7666e01b73952d667fcb371bb63066e79bc3e.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a2410dd2098bfb29e6c3cc6ac0e7666e01b73952d667fcb371bb63066e79bc3e.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4357698532623976866" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/52e411fd7f12ac5bd584f8e5ea491f5cf1fe84c292c993393ab51989d07a9f8a.zip" -> "builds/a2410dd2098bfb29e6c3cc6ac0e7666e01b73952d667fcb371bb63066e79bc3e.zip"
          ~ "timestamp" = "1758708047016446200" -> "1758793418968197200"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8417201753330584331" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708047933671000" -> "1758793420157404800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "9099467524454686843" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708047946268000" -> "1758793419627752000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5887403592545590458" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708047356297000" -> "1758793419144582000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/c0fabd6fdfa795c07507fcca460748248e866e415b601681a8411e730368147f.zip" -> "builds/f366456c6e219bdb35f5a0a5c9292b3709b96c2288304174decc4aad5cd8dc6b.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-09-24T10:04:44.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f366456c6e219bdb35f5a0a5c9292b3709b96c2288304174decc4aad5cd8dc6b.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f366456c6e219bdb35f5a0a5c9292b3709b96c2288304174decc4aad5cd8dc6b.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5179800084026571937" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c0fabd6fdfa795c07507fcca460748248e866e415b601681a8411e730368147f.zip" -> "builds/f366456c6e219bdb35f5a0a5c9292b3709b96c2288304174decc4aad5cd8dc6b.zip"
          ~ "timestamp" = "1758708047638025000" -> "1758793419060083000"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5259389811281897918" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708047936255000" -> "1758793419328698000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4777491296327118465" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708046966155000" -> "1758793419778669200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3084921179263640245" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708047721761000" -> "1758793419667929800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4023721668963035247" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708047523174000" -> "1758793419558808000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2686363879998228176" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708047844421000" -> "1758793419424704000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6663861270553945692" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708048021779000" -> "1758793419544074000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "753311323544068451" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708047375758800" -> "1758793420417461000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3002966248604157230" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708047254304800" -> "1758793420452396000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6441507975753322989" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708047155899000" -> "1758793419071271800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1344487640702101567" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708046571185200" -> "1758793418876121000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2555697056230422037" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708047840518000" -> "1758793420345618000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:03522a06568d28f95a017f8df5c500edbd73091cc10dcfb549bd3e49453d94e4" -> (known after apply)
      ~ last_modified                  = "2025-09-24T10:06:03.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2814727278457773959" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758708047237974800" -> "1758793418725076000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15" -> (known after apply)
      ~ code_sha256                 = "AQXG+eg8NocWAmEDwglTNZsQjlbeZn5a1XzfZUCV4YA=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-24T10:04:18.085+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:15" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/3528a8cbd09c39fe987fbb114e91c79d74423e96aabf7bace06d225b5d2ca598.zip" -> "builds/a3b79355da7886f94080db18300605fa04b2dcf3f5b65f0642ffde54c7709d67.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 24398887 -> (known after apply)
      ~ version                     = "15" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20250331043640018600000001/builds/3528a8cbd09c39fe987fbb114e91c79d74423e96aabf7bace06d225b5d2ca598.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "5a1cdd7b262dda6d8b51cfc1190f40cd-5" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers20250331043640018600000001/builds/3528a8cbd09c39fe987fbb114e91c79d74423e96aabf7bace06d225b5d2ca598.zip" -> (known after apply)
      ~ key                           = "builds/3528a8cbd09c39fe987fbb114e91c79d74423e96aabf7bace06d225b5d2ca598.zip" -> "builds/a3b79355da7886f94080db18300605fa04b2dcf3f5b65f0642ffde54c7709d67.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/3528a8cbd09c39fe987fbb114e91c79d74423e96aabf7bace06d225b5d2ca598.zip" -> "builds/a3b79355da7886f94080db18300605fa04b2dcf3f5b65f0642ffde54c7709d67.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a3b79355da7886f94080db18300605fa04b2dcf3f5b65f0642ffde54c7709d67.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a3b79355da7886f94080db18300605fa04b2dcf3f5b65f0642ffde54c7709d67.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2295540251135274953" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3528a8cbd09c39fe987fbb114e91c79d74423e96aabf7bace06d225b5d2ca598.zip" -> "builds/a3b79355da7886f94080db18300605fa04b2dcf3f5b65f0642ffde54c7709d67.zip"
          ~ "timestamp" = "1758708054481652000" -> "1758793434059398000"
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11" -> (known after apply)
      ~ code_sha256                 = "VbYe92JqRAzWfUCVDOdYw8vJQp6fhpq5scmtjwc7d7s=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-24T10:04:03.879+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:11" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/56cc2fff6bf54652e9a60c31936c3f10374d574d0ba0261851857eb83e47bb8f.zip" -> "builds/878012d3ee49914320804faaad92255721466db66776b9c9c253e89189e276ad.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 120528 -> (known after apply)
      ~ version                     = "11" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20250331043640018600000001/builds/56cc2fff6bf54652e9a60c31936c3f10374d574d0ba0261851857eb83e47bb8f.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "aa2d2b548679dcf2628b51a8c99af9a5" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers20250331043640018600000001/builds/56cc2fff6bf54652e9a60c31936c3f10374d574d0ba0261851857eb83e47bb8f.zip" -> (known after apply)
      ~ key                           = "builds/56cc2fff6bf54652e9a60c31936c3f10374d574d0ba0261851857eb83e47bb8f.zip" -> "builds/878012d3ee49914320804faaad92255721466db66776b9c9c253e89189e276ad.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/56cc2fff6bf54652e9a60c31936c3f10374d574d0ba0261851857eb83e47bb8f.zip" -> "builds/878012d3ee49914320804faaad92255721466db66776b9c9c253e89189e276ad.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/878012d3ee49914320804faaad92255721466db66776b9c9c253e89189e276ad.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/878012d3ee49914320804faaad92255721466db66776b9c9c253e89189e276ad.plan.json"
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.